Ran Plan for 2 projects:

1. project: `org-read` dir: `org-read` workspace: `default`
1. project: `access` dir: `access` workspace: `default`
---

### 1. project: `org-read` dir: `org-read` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.org_read will be updated in-place
~ resource "aws_iam_role" "org_read" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "sts:ExternalId" = "external-340c+b540,d21b/43b4:8979=2749@e0d3.13c4" -> "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = [
                              ~ "arn:aws:iam::880584957794:role/dev-stacklet-platform" -> "arn:aws:iam::179874453562:role/qa-stacklet-platform",
                              ~ "arn:aws:iam::880584957794:role/dev-collector" -> "arn:aws:iam::179874453562:role/qa-collector",
                            ]
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "atlantis-org-read"
        name                  = "atlantis-org-read"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p org-read
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://python.atlantis.stacklet.dev/lock?id=stacklet%252Fterraform-aws-onboarding%252Forg-read%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p org-read
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. project: `access` dir: `access` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.forward["us-east-1"] will be created
+ resource "aws_cloudwatch_event_rule" "forward" {
      + arn            = (known after apply)
      + description    = "Event forwarding for atlantis Stacklet deployment"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + "$or" = [
                  + {
                      + detail      = {
                          + errorCode       = [
                              + {
                                  + exists = false
                                },
                            ]
                          + eventSource     = [
                              + {
                                  + anything-but = [
                                      + "sts.amazonaws.com",
                                    ]
                                },
                            ]
                          + managementEvent = [
                              + true,
                            ]
                          + readOnly        = [
                              + false,
                            ]
                        }
                      + detail-type = [
                          + "AWS API Call via CloudTrail",
                        ]
                    },
                  + {
                      + detail-type = [
                          + "AWS Console Sign In via CloudTrail",
                          + "EC2 Instance State-change Notification",
                          + "GuardDuty Finding",
                          + "AWS Health Event",
                          + "EC2 Instance Launch Successful",
                          + "EC2 Instance Launch Unsuccessful",
                          + "EC2 Instance Terminate Successful",
                          + "EC2 Instance Terminate Unsuccessful",
                          + "Security Hub Findings - Imported",
                          + "Security Hub Findings - Custom Action",
                          + "Security Hub Insight Results",
                        ]
                    },
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "atlantis-event-forward"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.forward["us-east-2"] will be created
+ resource "aws_cloudwatch_event_rule" "forward" {
      + arn            = (known after apply)
      + description    = "Event forwarding for atlantis Stacklet deployment"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + "$or" = [
                  + {
                      + detail      = {
                          + errorCode       = [
                              + {
                                  + exists = false
                                },
                            ]
                          + eventSource     = [
                              + {
                                  + anything-but = [
                                      + "sts.amazonaws.com",
                                    ]
                                },
                            ]
                          + managementEvent = [
                              + true,
                            ]
                          + readOnly        = [
                              + false,
                            ]
                        }
                      + detail-type = [
                          + "AWS API Call via CloudTrail",
                        ]
                    },
                  + {
                      + detail-type = [
                          + "AWS Console Sign In via CloudTrail",
                          + "EC2 Instance State-change Notification",
                          + "GuardDuty Finding",
                          + "AWS Health Event",
                          + "EC2 Instance Launch Successful",
                          + "EC2 Instance Launch Unsuccessful",
                          + "EC2 Instance Terminate Successful",
                          + "EC2 Instance Terminate Unsuccessful",
                          + "Security Hub Findings - Imported",
                          + "Security Hub Findings - Custom Action",
                          + "Security Hub Insight Results",
                        ]
                    },
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "atlantis-event-forward"
      + name_prefix    = (known after apply)
      + region         = "us-east-2"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.forward["us-east-1"] will be created
+ resource "aws_cloudwatch_event_target" "forward" {
      + arn            = "arn:aws:events:us-east-1:179874453562:event-bus/default"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + role_arn       = (known after apply)
      + rule           = "atlantis-event-forward"
      + target_id      = "atlantis-event-forward"
    }

  # aws_cloudwatch_event_target.forward["us-east-2"] will be created
+ resource "aws_cloudwatch_event_target" "forward" {
      + arn            = "arn:aws:events:us-east-2:179874453562:event-bus/default"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-2"
      + role_arn       = (known after apply)
      + rule           = "atlantis-event-forward"
      + target_id      = "atlantis-event-forward"
    }

  # aws_iam_policy.forward["us-east-1"] will be created
+ resource "aws_iam_policy" "forward" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Forward events for atlantis Stacklet deployment in region us-east-1"
      + id               = (known after apply)
      + name             = "atlantis-forward-events-us-east-1"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "events:PutEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-1:179874453562:event-bus/default"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.forward["us-east-2"] will be created
+ resource "aws_iam_policy" "forward" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Forward events for atlantis Stacklet deployment in region us-east-2"
      + id               = (known after apply)
      + name             = "atlantis-forward-events-us-east-2"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "events:PutEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-2:179874453562:event-bus/default"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.discover will be updated in-place
~ resource "aws_iam_role" "discover" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "sts:ExternalId" = "external-340c+b540,d21b/43b4:8979=2749@e0d3.13c4" -> "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::880584957794:role/dev-collector" -> "arn:aws:iam::179874453562:role/qa-collector"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "atlantis-discover"
        name                  = "atlantis-discover"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.execution will be updated in-place
~ resource "aws_iam_role" "execution" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "sts:ExternalId" = "external-340c+b540,d21b/43b4:8979=2749@e0d3.13c4" -> "b5748e1f-0fa5-47c2-b9e2-84108424dd6a"
                            }
                        }
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::880584957794:role/dev-stacklet-execution" -> "arn:aws:iam::179874453562:role/qa-stacklet-execution"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "atlantis-execution"
        name                  = "atlantis-execution"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.forward[0] will be created
+ resource "aws_iam_role" "forward" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Event forwarding for atlantis Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-forward"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.forward["us-east-1"] will be created
+ resource "aws_iam_role_policy_attachment" "forward" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "atlantis-forward"
    }

  # aws_iam_role_policy_attachment.forward["us-east-2"] will be created
+ resource "aws_iam_role_policy_attachment" "forward" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "atlantis-forward"
    }

Plan: 9 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p access
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://python.atlantis.stacklet.dev/lock?id=stacklet%252Fterraform-aws-onboarding%252Faccess%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p access
  ```
Plan: 9 to add, 2 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```